using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TravelerGame
{
    // Сделать простенькую игру, персонаж идет по дороге видит врага,  вступает в бой, если побеждает, 
    //то идет дальше, если встречает торговца торгует. 
    // наварачивать игру как душе угодно: выбор персонажа с характеристиками, осмотр трупов, разные враги, приемы, состояния.
    // Создать интрефес, создать класс на основе интерфеса, реализовать foreach по членам класса,
    // Foreach реализовать с помощью итератора yeild, 
    // а так же реализовав интерфейсы IEnumerable и IEnumerator (Реализовав метод GetEnumerator)
    // отработать конструкторы (связанный вызов конструкторов.)
    class Program
    {
        static void Main(string[] args)
        {
            /* TODO: 
            - Генерация биомов */
            ///- Механика боя
            ///- Механика путешествия по биомам
            ///- Получение предметов с врагов и сундуков
            ///- Раелизовать торговлю с торговцем

           
        }
    }

   
}
